micropython/micropython/ports/mimxrt/machine_encoder.c
// decode the AF objects module and Port numer. Returns NULL if it is not a XBAR object
STATIC const machine_pin_af_obj_t *af_name_decode_xbar(const machine_pin_af_obj_t *af_obj,
    xbar_input_signal_t *io_number) {
    const char *str;
    size_t len;
    str = (char *)qstr_data(af_obj->name, &len);
    // test for the name starting with XBAR_INOUT
    if (len < 12 || strncmp(str, "XBAR_INOUT", 10) != 0) {
        return NULL;
    }
    // Get I/O number, e.g. XBAR_INOUT03
    *io_number = (str[10] - '0') * 10 + (str[11] - '0');
    return af_obj;
}

STATIC const machine_pin_af_obj_t *find_xbar_af(const machine_pin_obj_t *pin, xbar_input_signal_t *io_number) {
    const machine_pin_af_obj_t *af = NULL;
    for (int i = 0; i < pin->af_list_len; ++i) {
        af = af_name_decode_xbar(&(pin->af_list[i]), io_number);
        if (af != NULL) {
            return af;
        }
    }
    mp_raise_ValueError(MP_ERROR_TEXT("invalid input Pin"));
}

STATIC uint8_t connect_pin_to_encoder(mp_obj_t desc, xbar_output_signal_t encoder_signal, uint8_t direction) {
    xbar_input_signal_t xbar_pin;
    const machine_pin_obj_t *pin = pin_find(desc);
    const machine_pin_af_obj_t *af = find_xbar_af(pin,  &xbar_pin);
    encoder_set_iomux(pin, af);
    if (direction == XBAR_IN) {
        XBARA_SetSignalsConnection(XBARA1, xbar_pin, encoder_signal);
    } else {
        // No API here, so do basic Register access.
        if (xbar_pin >= XBAR_OUT_MIN && xbar_pin <= XBAR_OUT_MAX) {
            IOMUXC_GPR->XBAR_ENC_DIR_REGISTER |= 1 << (xbar_pin + XBAR_ENC_DIR_OFFSET); // Compare the offset 12 with other MCU
            XBARA_SetSignalsConnection(XBARA1, encoder_signal, xbar_pin);
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid match Pin"));
        }
    }
    return xbar_pin;
}

STATIC void clear_encoder_registers(machine_encoder_obj_t *self) {
    // Create a High pulse on the Trigger input, clearing Position, Revolution and Hold registers.
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicHigh, xbar_signal_table[self->id].enc_trigger);
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[self->id].enc_trigger);
}

//
// Functions for configuring the ENC Device
//
// Calculate the filter parameters based on a filter_ns value, telling the shortest
// pulse that will be detected.
//
STATIC uint32_t calc_filter(uint32_t filter_ns, uint16_t *count, uint16_t *period) {

    uint32_t freq_khz = CLOCK_GetIpgFreq() / 1000;
    uint32_t cycles = (filter_ns * (freq_khz / 1000)) / 1000;
    if (cycles == 0) {
        // Set filter off
        *count = 0;
        *period = 0;
    } else {
        uint16_t pmax = cycles / 10;
        if (pmax > 255) {
            pmax = 255;
        }
        if (pmax == 0) {
            pmax = 1;
        }
        uint16_t cnt;
        cnt = cycles / pmax;
        if (cnt > 10) {
            cnt = 10;
        }
        *count = cnt >= 3 ? cnt - 3 : 0;
        *period = pmax;
    }
    return ((1000000000 / freq_khz) + 1) * (*count + 3) * *period / 1000;
}

// Micropython API functions
//
STATIC void mp_machine_encoder_init_helper_common(machine_encoder_obj_t *self,
    mp_arg_val_t args[], enc_config_t *enc_config) {

    enum { ARG_match_pin, ARG_filter_ns, ARG_cpc, ARG_signed, ARG_index };

    // Check for a Match pin for the compare match signal
    if (args[ARG_match_pin].u_obj != MP_ROM_INT(-1)) {
        if (args[ARG_match_pin].u_obj != mp_const_none) {
            self->match_pin = connect_pin_to_encoder(args[ARG_match_pin].u_obj, xbar_signal_table[self->id].enc_match, XBAR_OUT);
        } else {
            // Disconnect the XBAR from the output by switching it to an input.
            IOMUXC_GPR->XBAR_ENC_DIR_REGISTER &= ~(1 << (self->match_pin + XBAR_ENC_DIR_OFFSET));
        }
    }

    if (args[ARG_filter_ns].u_int >= 0) {
        self->filter = calc_filter(args[ARG_filter_ns].u_int,
            &(enc_config->filterCount), &(enc_config->filterSamplePeriod));
    }

    if (args[ARG_cpc].u_obj != mp_const_none) {
        uint32_t cpc = mp_obj_int_get_truncated(args[ARG_cpc].u_obj);
        self->cpc = cpc;
        if (cpc == 0) {
            enc_config->enableModuloCountMode = false;
            enc_config->positionModulusValue = 0;
            enc_config->positionInitialValue = 0;
            self->is_signed = false;
        } else {
            enc_config->enableModuloCountMode = true;
            enc_config->positionModulusValue = cpc - 1;
            self->is_signed = true;
        }
    }

    if (args[ARG_signed].u_int >= 0) {
        self->is_signed = !!args[ARG_signed].u_int;
    }

    // Count cycles on RollOverModulus or index pulse
    if (args[ARG_index].u_obj != MP_ROM_INT(-1)) {
        if (args[ARG_index].u_obj != mp_const_none) {
            connect_pin_to_encoder(args[ARG_index].u_obj, xbar_signal_table[self->id].enc_index, XBAR_IN);
            enc_config->revolutionCountCondition = kENC_RevolutionCountOnINDEXPulse;
            enc_config->INDEXTriggerMode = kENC_INDEXTriggerOnRisingEdge;
        } else {
            enc_config->revolutionCountCondition = kENC_RevolutionCountOnRollOverModulus;
            XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[self->id].enc_index);
        }
    }

    // Initialize the ENC module and start
    ENC_Init(self->instance, enc_config);
    clear_encoder_registers(self);
    ENC_ClearStatusFlags(self->instance, 0xff); // Clear all status flags
}

STATIC void mp_machine_encoder_init_helper(machine_encoder_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_phase_a, ARG_phase_b, ARG_home,
           ARG_match_pin, ARG_filter_ns, ARG_cpc, ARG_signed, ARG_index};

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_phase_a, MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_phase_b, MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_home, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
        { MP_QSTR_match_pin, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
        { MP_QSTR_filter_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_cpc, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_signed, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_index, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

