micropython/micropython/ports/mimxrt/machine_encoder.c
    // Process the Encoder specific keyword arguments
    // Get referred Pin object(s) and connect them to the encoder
    if (args[ARG_phase_a].u_obj != mp_const_none) {
        self->input_a = connect_pin_to_encoder(args[ARG_phase_a].u_obj, xbar_signal_table[self->id].enc_input_a, XBAR_IN);
    }
    if (args[ARG_phase_b].u_obj != mp_const_none) {
        self->input_b = connect_pin_to_encoder(args[ARG_phase_b].u_obj, xbar_signal_table[self->id].enc_input_b, XBAR_IN);
    }
    // Check for valid input pins
    if (self->input_a == 0 || self->input_b == 0 || self->input_a == self->input_b) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid or missing input pins"));
    }

    // Check for a Home pin, resetting the counters
    if (args[ARG_home].u_obj != MP_ROM_INT(-1)) {
        if (args[ARG_home].u_obj != mp_const_none) {
            connect_pin_to_encoder(args[ARG_home].u_obj, xbar_signal_table[self->id].enc_home, XBAR_IN);
            self->enc_config.HOMETriggerMode = kENC_HOMETriggerOnRisingEdge;
        } else {
            XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[self->id].enc_home);
        }
    }

    // Set the common options
    mp_machine_encoder_init_helper_common(self, args + ARG_match_pin, &self->enc_config);

    ENC_DoSoftwareLoadInitialPositionValue(self->instance); /* Update the position counter with initial value. */
}

// Qencoder(id, input_a, input_b, [args])
STATIC mp_obj_t mp_machine_encoder_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // Check number of arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    CLOCK_EnableClock(kCLOCK_Iomuxc); // just in case it was not set yet
    XBARA_Init(XBARA1);

    uint8_t id = mp_obj_get_int(args[0]);
    if (id < 0 || id >= FSL_FEATURE_SOC_ENC_COUNT) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid encoder/counter id"));
    }
    // check, if the encoder is already in use, and if yes, dinit it
    if (encoder_table[id] != NULL) {
        encoder_deinit_single(encoder_table[id]);
    }

    // Connect the trigger input to low level
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[id].enc_trigger);

    // Create and populate the Qencoder object.
    machine_encoder_obj_t *self = m_new_obj(machine_encoder_obj_t);
    encoder_table[id] = self;
    self->id = id;
    self->input_a = 0;
    self->input_b = 0;
    self->base.type = &machine_encoder_type;
    self->instance = enc_instances[id + 1];
    self->cpc = 0;
    self->status = 0;
    self->irq = NULL;
    self->match_pin = 0;
    self->is_signed = true;
    self->mode = MODE_ENCODER;

    // Set defaults for ENC Config
    ENC_GetDefaultConfig(&self->enc_config);
    self->enc_config.enableTRIGGERClearPositionCounter = true;
    self->enc_config.revolutionCountCondition = kENC_RevolutionCountOnRollOverModulus;

    // Process the remaining parameters
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_encoder_init_helper(self, n_args - 1, args + 1, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

STATIC void encoder_deinit_single(machine_encoder_obj_t *self) {
    if (self->irq->handler) {
        DisableIRQ(enc_irqn[self->id + 1]);
        ENC_DisableInterrupts(self->instance, ENCODER_ALL_INTERRUPTS);
    }
    if (self->match_pin != 0) {
        // Disconnect the XBAR from the output by switching it to an input.
        IOMUXC_GPR->XBAR_ENC_DIR_REGISTER &= ~(1 << (self->match_pin + XBAR_ENC_DIR_OFFSET));
    }
    ENC_Deinit(self->instance);
}

// encoder_deinit_all()
void machine_encoder_deinit_all(void) {
    for (int i = 0; i < ARRAY_SIZE(encoder_table); i++) {
        if (encoder_table[i] != NULL) {
            encoder_deinit_single(encoder_table[i]);
            encoder_table[i] = NULL;
        }
    }
}

// encoder.deinit()
STATIC mp_obj_t machine_encoder_deinit(mp_obj_t self_in) {
    encoder_deinit_single(MP_OBJ_TO_PTR(self_in));
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_encoder_deinit_obj, machine_encoder_deinit);

// encoder.status()
mp_obj_t machine_encoder_status(mp_obj_t self_in) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(self_in);
    return MP_OBJ_NEW_SMALL_INT(self->status & (self->requested_irq | kENC_LastCountDirectionFlag));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_encoder_status_obj, machine_encoder_status);

// encoder.value([value])
STATIC mp_obj_t machine_encoder_value(size_t n_args, const mp_obj_t *args) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    uint32_t actual_value = ENC_GetPositionValue(self->instance);
    if (n_args > 1) {
        // Set the encoder position value and clear the rev counter.
        uint32_t value = mp_obj_int_get_truncated(args[1]);
        clear_encoder_registers(self);
        // Set the position and rev register
        ENC_SetInitialPositionValue(self->instance, value);
        ENC_DoSoftwareLoadInitialPositionValue(self->instance);
        // Reset the INIT Value
        ENC_SetInitialPositionValue(self->instance, 0);
    }
    // Get the position as signed or unsigned 32 bit value.
    if (self->is_signed) {
        return mp_obj_new_int((int32_t)actual_value);
    } else {
        return mp_obj_new_int_from_uint(actual_value);
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_encoder_value_obj, 1, 2, machine_encoder_value);

// encoder.cycles([value])
STATIC mp_obj_t machine_encoder_cycles(size_t n_args, const mp_obj_t *args) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    int16_t cycles = (int16_t)ENC_GetRevolutionValue(self->instance);
    if (n_args > 1) {
        // Set the revolution value
        self->instance->REV = mp_obj_get_int(args[1]);
    }
    return MP_OBJ_NEW_SMALL_INT(cycles);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_encoder_cycles_obj, 1, 2, machine_encoder_cycles);

// encoder.irq(trigger=ENCODER.IRQ_MATCH, value=nnn, handler=None, hard=False)
STATIC mp_obj_t machine_encoder_irq(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_trigger, ARG_value, ARG_handler, ARG_hard };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_trigger, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_value, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_handler, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
        { MP_QSTR_hard, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);

