micropython/micropython/ports/mimxrt/machine_encoder.c
    if (self->irq == NULL) {
        self->irq = m_new_obj(mp_irq_obj_t);
        self->irq->base.type = &mp_irq_type;
        self->irq->parent = MP_OBJ_FROM_PTR(self);
        self->irq->methods = NULL;
        self->irq->ishard = false;
    }

    uint16_t trigger = args[ARG_trigger].u_int &
        (ENCODER_TRIGGER_MATCH | ENCODER_TRIGGER_ROLL_UNDER | ENCODER_TRIGGER_ROLL_OVER);

    if (args[ARG_value].u_obj != mp_const_none) {
        uint32_t value = mp_obj_int_get_truncated(args[ARG_value].u_obj);
        self->enc_config.positionCompareValue = value;
        self->instance->LCOMP = (uint16_t)(value) & 0xffff;        /* Lower 16 pos bits. */
        self->instance->UCOMP = (uint16_t)(value >> 16U) & 0xffff; /* Upper 16 pos bits. */
        trigger |= ENCODER_TRIGGER_MATCH;
    }

    self->irq->handler = args[ARG_handler].u_obj;
    self->irq->ishard = args[ARG_hard].u_bool;
    self->requested_irq = trigger;
    // Clear pending interrupt flags
    ENC_ClearStatusFlags(self->instance, ENCODER_ALL_INTERRUPTS);
    if (self->irq->handler != mp_const_none) {
        ENC_DisableInterrupts(self->instance, ENCODER_ALL_INTERRUPTS);
        ENC_EnableInterrupts(self->instance, trigger);
        EnableIRQ(enc_irqn[self->id + 1]);
    } else {
        ENC_DisableInterrupts(self->instance, trigger);
        DisableIRQ(enc_irqn[self->id + 1]);
    }
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(machine_encoder_irq_obj, 1, machine_encoder_irq);

// encoder.init([kwargs])
STATIC mp_obj_t machine_encoder_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    mp_machine_encoder_init_helper(args[0], n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(machine_encoder_init_obj, 1, machine_encoder_init);

// encoder.id()
STATIC mp_obj_t machine_encoder_id(mp_obj_t self_in) {
    machine_encoder_obj_t *self = MP_OBJ_TO_PTR(self_in);
    return MP_OBJ_NEW_SMALL_INT(self->id);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_encoder_id_obj, machine_encoder_id);

STATIC const mp_rom_map_elem_t machine_encoder_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_encoder_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_encoder_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq), MP_ROM_PTR(&machine_encoder_irq_obj) },
    { MP_ROM_QSTR(MP_QSTR_value), MP_ROM_PTR(&machine_encoder_value_obj) },
    { MP_ROM_QSTR(MP_QSTR_cycles), MP_ROM_PTR(&machine_encoder_cycles_obj) },
    { MP_ROM_QSTR(MP_QSTR_status), MP_ROM_PTR(&machine_encoder_status_obj) },
    { MP_ROM_QSTR(MP_QSTR_id), MP_ROM_PTR(&machine_encoder_id_obj) },

    { MP_ROM_QSTR(MP_QSTR_IRQ_MATCH), MP_ROM_INT(ENCODER_TRIGGER_MATCH) },
    { MP_ROM_QSTR(MP_QSTR_IRQ_ROLL_UNDER), MP_ROM_INT(ENCODER_TRIGGER_ROLL_UNDER) },
    { MP_ROM_QSTR(MP_QSTR_IRQ_ROLL_OVER), MP_ROM_INT(ENCODER_TRIGGER_ROLL_OVER) },
};
STATIC MP_DEFINE_CONST_DICT(machine_encoder_locals_dict, machine_encoder_locals_dict_table);

const mp_obj_type_t machine_encoder_type = {
    { &mp_type_type },
    .name = MP_QSTR_Encoder,
    .print = mp_machine_encoder_print,
    .make_new = mp_machine_encoder_make_new,
    .locals_dict = (mp_obj_dict_t *)&machine_encoder_locals_dict,
};

// --- Counter class code ----------

STATIC void mp_machine_counter_init_helper(machine_encoder_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_src, ARG_direction, ARG_match_pin, ARG_filter_ns, ARG_cpc, ARG_signed,  ARG_index };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_src, MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_direction, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
        { MP_QSTR_match_pin, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
        { MP_QSTR_filter_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_cpc, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = mp_const_none} },
        { MP_QSTR_signed, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_index, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_INT(-1)} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (args[ARG_src].u_obj != mp_const_none) {
        self->input_a = connect_pin_to_encoder(args[ARG_src].u_obj, xbar_signal_table[self->id].enc_input_a, XBAR_IN);
    }
    if (self->input_a == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("missing input pin"));
    }

    mp_obj_t direction = args[ARG_direction].u_obj;
    if (direction != MP_ROM_INT(-1)) {
        if (direction == MP_ROM_INT(COUNTER_UP)) {
            XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[self->id].enc_input_b);
        } else if (direction == MP_ROM_INT(COUNTER_DOWN)) {
            XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicHigh, xbar_signal_table[self->id].enc_input_b);
        } else {
            connect_pin_to_encoder(direction, xbar_signal_table[self->id].enc_input_b, XBAR_IN);
        }
    }

    // Set the common options and start
    mp_machine_encoder_init_helper_common(self, args + ARG_match_pin, &self->enc_config);
}

// Counter(id, input, [args])
STATIC mp_obj_t mp_machine_counter_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // Check number of arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    CLOCK_EnableClock(kCLOCK_Iomuxc); // just in case it was not set yet
    XBARA_Init(XBARA1);

    uint8_t id = mp_obj_get_int(args[0]);
    if (id < 0 || id >= FSL_FEATURE_SOC_ENC_COUNT) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid encoder/counter id"));
    }
    // check, if the encoder is already in use, and if yes, dinit it
    if (encoder_table[id] != NULL) {
        encoder_deinit_single(encoder_table[id]);
    }

    // Connect input_b and the trigger input to a fixed level.
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[id].enc_input_b);
    XBARA_SetSignalsConnection(XBARA1, kXBARA1_InputLogicLow, xbar_signal_table[id].enc_trigger);

